app/controllers/incomes_controller.rb

SELECT `incomes`.* FROM `incomes`
---
    def show

        @incomes = Income.all

INSERT INTO `incomes` (`amount`, `date`, `description`, `username`, `created_at`, `updated_at`) VALUES ('2', '22/04/1992', 'Despesa com o gato!', 'lrocha3', '2015-01-22 12:04:31.349142', '2015-01-22 12:04:31.349142')
---
    def create
        @income = Income.new(income_params)
        if current_user
            @income.username = current_user.username
         end


        if @income.save