app/controllers/users_controller.rb

INSERT INTO `users` (`username`, `email`, `password`, `created_at`, `updated_at`) VALUES ('', '', '', '2015-01-21 22:54:36.070460', '2015-01-21 22:54:36.070460')
---
    def create
        @user = User.new(user_params)

        if @user.save